// 定义砖块的数据， 宽度 13 格， 高度 20 格
// 这个数组是用于初始化砖块的时候用的
// 所有的格子里面的数值都是0， 即白色方块
// 0 表示白色，1表示红色，2表示蓝色

// 注意： 这个blocks数组里面存放的是数字，数字会对应不同的颜色
var blocks = [
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
];

// 实例化俄罗斯方块场地类对象并调用

var map = new Map();

//显示场地
map.show();

// 渲染场地
map.render();

// 加载清除音乐
map.loadClearBrickMusic();
var shape = new Shape();
shape.loadGameOverMusics();

// 提供玩家操作的接口
$(document).keydown((e) => {
    switch (e.key) {
        case 'ArrowLeft':
            map.left();
            break;
        case 'ArrowDown':
            map.down();
            break;
        case 'ArrowUp':
            shape.rotate();
            break;
        case 'ArrowRight':
            map.right();
            break;
    }
})